In [1]:
import pandas as pd
dictionary = {  "NAME":["ali","veli","kenan","hilal","ayse","evren"],
                "AGE":[15,16,17,33,45,66],
                "SALARY": [100,150,240,350,110,220]} 
dataFrame1 = pd.DataFrame(dictionary) # Verilen bir listi (dict) kullanarak, bir veri tablosu olu≈üturur.
dataFrame1

    NAME  AGE  SALARY
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
5  evren   66     220

In [2]:
column_names = dataFrame1.columns
column_names

Index(['NAME', 'AGE', 'SALARY'], dtype='object')

In [3]:
dataFrame1.info() # pandas write object type instead string! Its okay :)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    6 non-null      object
 1   AGE     6 non-null      int64
 2   SALARY  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [4]:
dataFrame1.dtypes

NAME      object
AGE        int64
SALARY     int64
dtype: object

In [5]:
dataFrame1.describe()  # Numeric features = columns (age, salary)! :) Not string

             AGE      SALARY
count   6.000000    6.000000
mean   32.000000  195.000000
std    20.474374   94.815611
min    15.000000  100.000000
25%    16.250000  120.000000
50%    25.000000  185.000000
75%    42.000000  235.000000
max    66.000000  350.000000